% exercise_02_11.m
% 問題 2.11
% RLC 回路の伝達関数

clear
format compact

disp(' ')
disp('==================================================')
disp(' 問題 2.11')
disp('==================================================')

R = 290     % R = 290 [Ω]
L = 100e-3  % L = 100 [mH]
C = 1e-6    % C = 1 [μF]

disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')
disp('+  伝達関数 P(s)')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')

s = tf('s');                        % ラプラス演算子 s
sysP = 1/(L*C*s^2 + R*C*s + 1)      % 伝達関数 P(s) = N(s)/D(s)

sysP = tf(zpk(sysP))                % s^2 の係数を 1 にするために，いったん，
                                    % zpk で変換した後，再度，tf で変換
