% eoc04_02_block_combination.m
% ブロック線図の結合

clear
format compact

sysP1 = tf([1],[1 3 2])
sysP2 = tf([1],[10 1])

disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')
disp('+ 直列結合：P(s) = P1(s)*P2(s)')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')

sysP = sysP1*sysP2

disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')
disp('+ 並列結合：P(s) = P1(s) + P2(s)')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')

sysP = sysP1 + sysP2

disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')
disp('+ 並列結合：P(s) = P1(s) - P2(s)')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')

sysP = sysP1 - sysP2

disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')
disp('+ フィードバック結合：P(s) = P1(s)/(1 + P1(s)*P2(s))')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')

sysP1P2 = minreal(sysP1*sysP2);         % P1(s)*P2(s) を計算し，共通因子を約分
sysP = minreal(sysP1/(1 + sysP1P2))     % P(s) を計算し，共通因子を約分

disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')
disp('+ フィードバック結合：P(s) = P1(s)/(1 + P1(s)*P2(s))')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')

sysP = feedback(sysP1,sysP2)
