% example_04_07.m
% 例 4.7：フルビッツの安定判別法（係数にパラメータを含む場合）
% 【Symbolic Math Toolbox が必要】

clear
format compact

disp(' ')
disp('==================================================')
disp(' 例 4.7 ')
disp('==================================================')
disp(' ')

syms s
syms kP kI real
syms J c M g l positive

disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')
disp('+ 制御対象 P(s) = Np(s)/Dp(s)')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')

Ps = 1/(J*s^2 + c*s + M*g*l)
[Np Dp] = numden(Ps)

disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')
disp('+ コントローラ C(s) = Nc(s)/Dc(s)')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')

Cs = (kP*s + kI)/s
[Nc Dc] = numden(Cs)

disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')
disp('+ 特性多項式 Δ(s) = Dp(s)Dc(s) + Np(s)Nc(s)')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')

Delta = Dp*Dc + Np*Nc;
Delta = collect(Delta,s)

disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')
disp('+ フルビッツの安定判別法')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')

hurwitz_sym     % hurwitz_sym.m の実行




