% A3_03_save_3d_graph4.m
% 付録 A.3
% グラフの保存 (4)：print を利用（解像度の変更）
% 　　JPEG ファイル，PNG ファイル

clc
close all
clear
format compact

disp(' ')
disp('================================================================')
disp(' ■ グラフの保存 (4) ')
disp('================================================================')

disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++')
disp('+  >> [X,Y] = meshgrid(1:0.5:10,1:20);')
disp('+  >> Z = sin(X) + cos(Y);')
disp('+  >> figure(1)')
disp('+  >> surf(X,Y,Z)')
disp("+  >> set(gca,'FontSize',16,'FontName','Arial')")
disp('++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++')

[X,Y] = meshgrid(1:0.5:10,1:20);
Z = sin(X) + cos(Y);
 
figure(1)
surf(X,Y,Z)
set(gca,'FontSize',16,'FontName','Arial')
xlabel('x','FontSize',18,'FontName','Arial')
ylabel('y','FontSize',18,'FontName','Arial')
zlabel('z','FontSize',18,'FontName','Arial')
 
disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++')
disp('+ 標準の JPEG ファイル（解像度：150 dpi）')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++')
disp("+  >> print('3d_graph1','-djpeg')")
disp('+  >> % print -djpeg 3d_graph1')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++')

print('3d_graph1','-djpeg')
% print -djpeg 3d_graph1

disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++')
disp('+ 解像度を指定した JPEG ファイル（解像度：600 dpi）')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++')
disp("+  >> print('-r600','3d_graph2','-djpeg')")
disp('+  >> % print -djpeg -r600 3d_graph2')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++')

print('-r600','3d_graph2','-djpeg')
% print -djpeg -r600 3d_graph2


disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++')
disp('+ 標準の PNG ファイル（解像度：150 dpi）')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++')
disp("+  >> print('3d_graph1','-dpng')")
disp('+  >> % print -dpng 3d_graph1')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++')

print('3d_graph1','-dpng')
% print -dpng 3d_graph1

disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++')
disp('+ 解像度を指定した PNG ファイル（解像度：600 dpi）')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++')
disp("+  >> print('-r600','3d_graph2','-dpng')")
disp('+  >> % print -dpng -r600 3d_graph2')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++')

print('-r600','3d_graph2','-dpng')
% print -dpng -r600 3d_graph2


