% A3_03_save_3d_graph7.m
% 付録 A.3
% グラフの保存 (7)：exportgraphics を利用（ラスタ形式とベクタ形式）
% 　　PDF ファイル，拡張メタファイル，EPS ファイル

clc
close all
clear
format compact

disp(' ')
disp('================================================================')
disp(' ■ グラフの保存 (7) ')
disp('================================================================')

disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++')
disp('+  >> [X,Y] = meshgrid(1:0.5:10,1:20);')
disp('+  >> Z = sin(X) + cos(Y);')
disp('+  >> figure(1)')
disp('+  >> surf(X,Y,Z)')
disp("+  >> set(gca,'FontSize',16,'FontName','Arial')")
disp('++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++')

[X,Y] = meshgrid(1:0.5:10,1:20);
Z = sin(X) + cos(Y);
 
figure(1)
surf(X,Y,Z)
set(gca,'FontSize',16,'FontName','Arial')
xlabel('x','FontSize',18,'FontName','Arial')
ylabel('y','FontSize',18,'FontName','Arial')
zlabel('z','FontSize',18,'FontName','Arial')

disp(' ')
disp('=============================================================')
disp('exportgraphics は R2020a 以降で動作します')
disp('=============================================================')

v = ver('MATLAB')

if v.Release < "(R2020a)"
    disp(' ')
    disp('***********************************************')
    disp('使用しているバージョンが R2020a 以降ではありません')
    disp('***********************************************')
else
    disp(' ')
    disp('++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++')
    disp('+ 標準の PDF ファイル (複雑なグラフなのでラスタ形式となる)')
    disp('++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++')
    disp("+  >> exportgraphics(gcf,'3d_graph3.pdf'))")
    disp('++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++')
    
    exportgraphics(gcf,'3d_graph3.pdf')
    
    disp(' ')
    disp('++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++')
    disp('+ ベクタ形式の PDF ファイル')
    disp('++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++')
    disp("+  >> exportgraphics(gcf,'3d_graph4.pdf','ContentType','vector')")
    disp('++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++')
    
    exportgraphics(gcf,'3d_graph4.pdf','ContentType','vector')
    
    disp(' ')
    disp('++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++')
    disp('+ 標準の拡張メタファイル (複雑なグラフなのでラスタ形式となる)')
    disp('++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++')
    disp("+  >> exportgraphics(gcf,'3d_graph3.emf'))")
    disp('++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++')
    
    exportgraphics(gcf,'3d_graph3.emf')
    
    disp(' ')
    disp('++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++')
    disp('+ ベクタ形式の拡張メタファイル')
    disp('++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++')
    disp("+  >> exportgraphics(gcf,'3d_graph4.emf','ContentType','vector')")
    disp('++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++')
    
    exportgraphics(gcf,'3d_graph4.emf','ContentType','vector')
end

