% A3_03_save_3d_graph5.m
% 付録 A.3
% グラフの保存 (5)：exportgraphics を利用（解像度の変更）
% 　　JPEG ファイル，PNG ファイル

clc
close all
clear
format compact

disp(' ')
disp('================================================================')
disp(' ■ グラフの保存 (5) ')
disp('================================================================')

disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++')
disp('+  >> [X,Y] = meshgrid(1:0.5:10,1:20);')
disp('+  >> Z = sin(X) + cos(Y);')
disp('+  >> figure(1)')
disp('+  >> surf(X,Y,Z)')
disp("+  >> set(gca,'FontSize',16,'FontName','Arial')")
disp('++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++')

[X,Y] = meshgrid(1:0.5:10,1:20);
Z = sin(X) + cos(Y);
 
figure(1)
surf(X,Y,Z)
set(gca,'FontSize',16,'FontName','Arial')
xlabel('x','FontSize',18,'FontName','Arial')
ylabel('y','FontSize',18,'FontName','Arial')
zlabel('z','FontSize',18,'FontName','Arial')

disp(' ')
disp('=============================================================')
disp('exportgraphics は R2020a 以降で動作します')
disp('=============================================================')

v = ver('MATLAB')

if v.Release < "(R2020a)"
    disp(' ')
    disp('***********************************************')
    disp('使用しているバージョンが R2020a 以降ではありません')
    disp('***********************************************')
else
    disp(' ')
    disp('++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++')
    disp('+ 標準の JPEG ファイル（解像度：150 dpi）')
    disp('++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++')
    disp("+  >> exportgraphics(gcf,'3d_graph3.jpg'))")
    disp('++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++')
    
    exportgraphics(gcf,'3d_graph3.jpg')
    
    disp(' ')
    disp('++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++')
    disp('+ 解像度を指定した JPEG ファイル（解像度：600 dpi）')
    disp('++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++')
    disp("+  >> exportgraphics(gcf,'3d_graph4.jpg','Resolution',600)")
    disp('++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++')
    
    exportgraphics(gcf,'3d_graph4.jpg','Resolution',600)

    disp(' ')
    disp('++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++')
    disp('+ 標準の PNG ファイル（解像度：150 dpi）')
    disp('++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++')
    disp("+  >> exportgraphics(gcf,'3d_graph3.png'))")
    disp('++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++')
    
    exportgraphics(gcf,'3d_graph3.png')
    
    disp(' ')
    disp('++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++')
    disp('+ 解像度を指定した PNG ファイル（解像度：600 dpi）')
    disp('++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++')
    disp("+  >> exportgraphics(gcf,'3d_graph4.png','Resolution',600)")
    disp('++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++')
    
    exportgraphics(gcf,'3d_graph4.png','Resolution',600)
end

