% exercise_04_09.m
% 問題 4.9：Simulink を利用したブロック線図の結合

[A B C D] = linmod('exercise_04_09_fbk_block');    % Simulink モデル exercise_04_09_fbk_block.slx から
sys = ss(A,B,C,D);                                 % 入力を In1, In2，出力を Out1, Out2 とした状態空間表現を生成
sys = tf(sys);      % 状態空間表現を伝達関数表現に変換


disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')
disp(' Gyr(s) ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')

sysGyr = sys(1,1)   % r(s) (In1) から y(s) (Out1) への伝達関数 Gyr(s)

disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')
disp(' Gyd(s) ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')

sysGyd = sys(1,2)   % d(s) (In2) から y(s) (Out1) への伝達関数 Gyd(s)

disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')
disp(' Gyd(s) ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')

sysGer = sys(2,1)   % r(s) (In1) から e(s) (Out2) への伝達関数 Ger(s)

disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')
disp(' Ged(s) ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')

sysGed = sys(2,2)   % d(s) (In2) から e(s) (Out2) への伝達関数 Ged(s)
