% example_03_07.m
% 例 3.7：逆ラプラス変換の計算
% 【Symbolic Math Toolbox が必要】

clear
format compact

syms s

disp(' ')
disp('==================================================')
disp(' 例 3.7 (1) ')
disp('==================================================')

fs = 1/s - 3/(s + 2) + 2/(s + 3)
ft = ilaplace(fs)

disp(' ')
disp('==================================================')
disp(' 例 3.7 (2) ')
disp('==================================================')

fs = (s - 2)/(s^2 + 2*s + 5)
ft = ilaplace(fs)
