% example_03_05b.m
% 例 3.5：余弦関数 f(t) = cos(w*t) 
%                        exp(jw*t) + exp(-jw*t)
%                      = ----------------------
%                                  2
% 　　　　のラプラス変換（オイラーの公式を利用）
% 【Symbolic Math Toolbox が必要】

clear
format compact

disp(' ')
disp('==================================================')
disp(' 例 3.5：余弦関数 f(t) = cos(w*t) のラプラス変換')
disp('==================================================')

syms s
syms t real
syms w positive

disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')
disp('+ f(t) = cos(w*t)')
disp('+        exp(jw*t) + exp(-jw*t)')
disp('+      = ----------------------')
disp('+                  2')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')

f(t) = (exp(j*w*t) + exp(-j*w*t))/2

disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')
disp('+ 不定積分 F_indef(s) = ∫ f(t)*exp(-s*t) dt')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')

F_indef(s) = int(f(t)*exp(-s*t),t)

assume(real(s) > 0)
assumptions(s)

disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')
disp('+ F_inf(s) = lim F_indef(s)')
disp('+           t->inf')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')

F_inf(s) = limit(F_indef(s),t,Inf)

disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')
disp('+ F_0(s) = lim F_indef(s)')
disp('+          t->0')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')

F_0(s) = limit(F_indef(s),t,0)

disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')
disp('+ 定義式に基づくラブラス変換 F(s) = F_inf(s) - F_0(s)')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')

F(s) = F_inf(s) - F_0(s)


