% exercise_03_01_02a.m
% 問題 3.1 (2)
% f(t) = sin(w*t) のラプラス変換
% 【Symbolic Math Toolbox が必要】

clear
format compact

disp(' ')
disp('==================================================')
disp(' 問題 3.1 (2)')
disp('==================================================')

syms s
syms t real
syms w positive

disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')
disp(' f(t) = sin(w*t)')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')

f(t) = sin(w*t)

disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')
disp(' 不定積分 F_indef(s) = ∫ f(t)*exp(-s*t) dt')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')

F_indef(s) = int(f(t)*exp(-s*t),t)

assume(real(s) > 0)
assumptions(s)

disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')
disp(' F_inf(s) = lim F_indef(s)')
disp('           t->inf')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')

F_inf(s) = limit(F_indef(s),t,Inf)

disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')
disp(' F_0(s) = lim F_indef(s)')
disp('          t->0')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')

F_0(s) = limit(F_indef(s),t,0)

disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')
disp(' 定義式に基づくラブラス変換 F(s) = F_inf(s) - F_0(s)')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')

F(s) = F_inf(s) - F_0(s)



