% exercise_03_05.m
% 問題 3.5：極と安定性

clear
format compact

s = tf('s');

disp(' ')
disp('==================================================')
disp(' 問題 3.5 (1) ')
disp('==================================================')

sysP = 1/((s + 1)*(s + 2))

disp(' ----- 極 -----')
p = pole(sysP)

if real(p) < 0
    disp(' ===> このシステムは安定です')
else
    disp(' ===> このシステムは安定ではありません')
end

disp(' ')
disp('==================================================')
disp(' 問題 3.5 (2) ')
disp('==================================================')

sysP = (s + 1)/((s - 1)*(s + 2))

disp(' ----- 極 -----')
p = pole(sysP)

if real(p) < 0
    disp(' ===> このシステムは安定です')
else
    disp(' ===> このシステムは安定ではありません')
end

disp(' ')
disp('==================================================')
disp(' 問題 3.5 (3) ')
disp('==================================================')

sysP = 1/(s^2 - 2*s + 2)

disp(' ----- 極 -----')
p = pole(sysP)

if real(p) < 0
    disp(' ===> このシステムは安定です')
else
    disp(' ===> このシステムは安定ではありません')
end

disp(' ')
disp('==================================================')
disp(' 問題 3.5 (4) ')
disp('==================================================')

sysP = (s - 1)/((s + 1)*(s^2 + 2*s + 2))

disp(' ----- 極 -----')
p = pole(sysP)

if real(p) < 0
    disp(' ===> このシステムは安定です')
else
    disp(' ===> このシステムは安定ではありません')
end

