% exercise_03_02.m
% 問題 3.2：ラプラス変換
% 【Symbolic Math Toolbox が必要】

clear
format compact

syms t real

disp(' ')
disp('==================================================')
disp(' 問題 3.2 (1) ')
disp('==================================================')

ft = 1 - exp(-5*t)
fs = laplace(ft)
fs = prod(factor(fs))

disp(' ')
disp('==================================================')
disp(' 問題 3.2 (2) ')
disp('==================================================')

ft = exp(-2*t) + 2*exp(t) - 3
fs = laplace(ft)
fs = prod(factor(fs))

disp(' ')
disp('==================================================')
disp(' 問題 3.2 (3) ')
disp('==================================================')

ft = 2*exp(-t) - 2*cos(2*t) + sin(2*t)
fs = laplace(ft)
fs = prod(factor(fs))

disp(' ')
disp('==================================================')
disp(' 問題 3.2 (4) ')
disp('==================================================')

ft = 3 + 2*t + 2*t^2 - 3*exp(-2*t)
fs = laplace(ft)
fs = prod(factor(fs))
