% exercise_04_02_01a.m
% 問題 4.2 (1)：内部安定性
% 【Symbolic Math Toolbox が必要】

clear
format compact

disp(' ')
disp('==================================================')
disp(' 問題 4.2 (1) ')
disp('==================================================')

s = tf('s')

disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')
disp(' 制御対象 P(s) = Np(s)/Dp(s)')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')

sysP = 1/(s - 1)
[Np Dp] = tfdata(sysP,'v')

disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')
disp(' コントローラ C(s) = Nc(s)/Dc(s)')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')

sysC = (2*s + 1)/s
[Nc Dc] = tfdata(sysC,'v')

disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')
disp(' 特性多項式 Δ(s) = Dp(s)*Dc(s) + Np(s)*Nc(s)')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')

Delta = conv(Dp,Dc) + conv(Np,Nc)

disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')
disp(' 特性方程式 Δ(s) = 0 の解')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')

s = roots(Delta)

disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')
disp(' 内部安定性の判別')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')
if real(s) < 0
    disp('内部安定である')
else
    disp('内部安定ではない')    
end

disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')
disp(' 4 つの伝達関数：Gyr(s), Gyd(s), Gur(s), Gud(s)')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')

sysPC  = minreal(sysP*sysC);

sysGyr = zpk(minreal(sysPC/(1 + sysPC)))
sysGyd = zpk(minreal(sysP /(1 + sysPC)))
sysGur = zpk(minreal(sysC /(1 + sysPC)))
sysGur = - sysGyr



