% exercise_04_04_02.m
% 問題 4.4 (2)：フルビッツの安定判別法（係数にパラメータを含む場合）
% 【Symbolic Math Toolbox が必要】

clear
format compact

disp(' ')
disp('==================================================')
disp(' 問題 4.4 (2) ')
disp('==================================================')
disp(' ')

syms s
syms kP kI real

disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')
disp(' 制御対象 P(s) = Np(s)/Dp(s)')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')

Ps = 5/(s^2 + 2*s + 2)
[Np Dp] = numden(Ps)

disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')
disp(' コントローラ C(s) = Nc(s)/Dc(s)')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')

Cs = (kP*s + kI)/s
[Nc Dc] = numden(Cs)

disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')
disp(' 特性多項式 Δ(s) = Dp(s)*Dc(s) + Np(s)*Nc(s)')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')

Delta = Dp*Dc + Np*Nc;
Delta = collect(Delta,s)

disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')
disp(' フルビッツの安定判別法')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')

hurwitz_sym     % hurwitz_sym.m の実行
