% exercise_04_07_01b.m
% 問題 4.7 (1)：定常位置偏差
% 【Symbolic Math Toolbox が必要】

clear
format compact

disp(' ')
disp('==================================================')
disp(' 問題 4.7 (1) ')
disp('==================================================')

syms s
syms kP real

disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')
disp(' 制御対象 P(s) = 5/(s^2 + 2*s + 2)')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')

Ps = 5/(s^2 + 2*s + 2)

disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')
disp(' コントローラ C(s) = kP')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')

Cs = kP

disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')
disp(' Ger(s) = 1/(1 + P(s)*C(s))')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')

Gers = 1/(1 + Ps*Cs);
Gers = collect(Gers,s)

disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')
disp(' フルビッツの安定判別法')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')

[N D] = numden(Gers);
Delta = D;
Delta = collect(Delta,s)

hurwitz_sym     % hurwitz_sym.m の実行

disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')
disp(' 定常位置偏差 e_inf = Ger(0)')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')

e_inf = subs(Gers,s,0)

disp(' ')
disp(' ----- kP = 2 のとき ----- ')
e_inf_2 = subs(e_inf,kP,2)

disp(' ')
disp(' ----- kP = 5 のとき ----- ')
e_inf_5 = subs(e_inf,kP,5)

