% example_08_02.m
% 例 8.2：鉛直面を回転するアーム系のモデル（状態空間表現から伝達関数表現への変換）
% 【Symbolic Math Toolbox が必要】

close all
clear
format compact

disp(' ')
disp('==================================================')
disp(' 例 8.2 ')
disp('==================================================')

syms s
syms M g l J c positive

disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')
disp(' 状態空間表現 ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')

A = [ 0         1
     -M*g*l/J  -c/J ]
B = [ 0
      1/J ]
C = [ 1  0 ]
D = 0

disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')
disp(' 伝達関数 P(s) = C*inv(s*I - A)*B + D ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')

Ps = C*inv(s*eye(2) - A)*B + D

