% example_07_03a.m
% 例 7.3：簡略化されたナイキストの安定判別法の利用例 (2)（図 7.8）

close all
clear
format compact

disp(' ')
disp('==================================================')
disp(' 例 7.3 ')
disp('==================================================')

disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')
disp(' P(s) = 1/(s + 1)^3 ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')

s = tf('s');
sysP = 1/(s + 1)^3

% ------------------------------------------------------
options = nyquistoptions;
options.ShowFullContour = 'off';
options.Title.String = 'ベクトル軌跡';

% ------------------------------------------------------
figure(1)

w = logspace(-3,2,1000);

for kP = [4 8 16]
    disp(' ')
    disp('++++++++++++++++++++++++++++++++++++++++++++++++++')
    disp(' C(s) = kP ')
    disp('++++++++++++++++++++++++++++++++++++++++++++++++++')

    sysC = kP
    
    disp(' ')
    disp('--------------------------------------------------')
    disp(' =====> L(s) = P(s)C(s)')
    disp('--------------------------------------------------')
    
    sysL = sysP*sysC

    nyquist(sysL,w,options)
    hold on
end

figure(1)
hold off

legend('kP = 4','kP = 8','kP = 16')


