% sec0633_03.m
% Ï•ª—v‘f‚ÌƒQƒCƒ“‚ÆˆÊ‘Š·
% ySymbolic Math Toolbox ‚ª•K—vz

clear
format compact

disp(' ')
disp('==================================================')
disp(' Ï•ª—v‘f P(s) = 1/(Ts) ‚ÌƒQƒCƒ“‚ÆˆÊ‘Š· ')
disp('==================================================')

syms s
syms w positive
syms K positive
syms T positive

Ps = 1/(T*s)

disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')
disp(' ü”g”“`’BŠÖ” P(jw) ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')

Pjw = subs(Ps,s,j*w)

disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')
disp(' À•” a = Re[P(jw)] ')
disp(' ‹••” b = Im[P(jw)] ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')

a = real(Pjw)
b = imag(Pjw)

disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')
disp(' ƒQƒCƒ“ Gg(w) = sqrt(a^2 + b^2)')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')

Gg = sqrt(a^2 + b^2);
Gg = simplify(expand(Gg))

disp(' ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')
disp(' ˆÊ‘Š· Gp(w) = atan(b/a) ')
disp('++++++++++++++++++++++++++++++++++++++++++++++++++')

Gp = atan(b/a)

